rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_read.c
/*
 * SPDX-FileCopyrightText: 2022 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <string.h>
#include <inttypes.h>
#include "esp_log.h"
#include "esp_err.h"
#include "esp_partition.h"
#include "esp_crc.h"
#include "nvs_flash.h"
#include "esp_secure_cert_read.h"
#include "esp_secure_cert_config.h"
#include "esp_secure_cert_tlv_config.h"
#include "esp_secure_cert_tlv_private.h"
#include "esp_heap_caps.h"

#if __has_include("esp_idf_version.h")
#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "spi_flash_mmap.h"
#endif
#endif

static const char *TAG = "esp_secure_cert";

typedef enum partition_format {
    ESP_SECURE_CERT_PF_INVALID = -1,
    ESP_SECURE_CERT_PF_CUST_FLASH,
    ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY,
    ESP_SECURE_CERT_PF_NVS,
    ESP_SECURE_CERT_PF_TLV,
} esp_secure_cert_part_fmt_t;

static esp_secure_cert_part_fmt_t current_partition_format = ESP_SECURE_CERT_PF_INVALID;
static const char *nvs_partition_name;
static const char *nvs_namespace_name;

// In case of esp_secure_cert nvs namespace is same as nvs partition name

#define NVS_STR         1
#define NVS_BLOB        2
#define NVS_U8          3
#define NVS_U16         4

/* API to find the esp_secure_cert partition
 * @params
 *  partition_type      The type of partition to find
 *  partition_name      The name of the partition to find
 *  partition_format    The partition_format of the partition,
 *                      The global variable current_partition_format shall
 *                      be set to this value if find partition operation
 *                      was successful
 */
static const esp_partition_t *esp_secure_cert_find_partition(esp_partition_type_t partition_type, const char *partition_name, esp_secure_cert_part_fmt_t format)
{
    esp_partition_iterator_t it = esp_partition_find(partition_type, ESP_PARTITION_SUBTYPE_ANY, partition_name);
    if (it != NULL) {
        current_partition_format = format;
        const esp_partition_t *part = esp_partition_get(it);
        if (part == NULL) {
            ESP_LOGE(TAG, "Failed to get partition");
            return NULL;
        } else {
            return part;
        }
    }
    // if it reaches here that means it is NULL
    return NULL;
}

static const esp_partition_t *esp_secure_cert_get_partition(void)
{
    static const esp_partition_t *part;
    if (part != NULL) {
        return part;
    }

    // This switch case statement is added for increasing readability
    // The actual behaviour is a simple fall through
    current_partition_format = ESP_SECURE_CERT_PF_TLV;

    switch (current_partition_format) {
    case ESP_SECURE_CERT_PF_TLV:
        part = esp_secure_cert_find_partition(ESP_SECURE_CERT_CUST_FLASH_PARTITION_TYPE, ESP_SECURE_CERT_TLV_PARTITION_NAME, ESP_SECURE_CERT_PF_TLV);
        if (part != NULL) {
            if (esp_secure_cert_is_tlv_partition()) {
                ESP_LOGI(TAG, "Pre-provisioned partition information:");
                ESP_LOGI(TAG, "partition format: %s, partition name: %s", "CUST_FLASH_TLV", ESP_SECURE_CERT_PARTITION_NAME);
                return part;
            }
        }
    // fall through
    case ESP_SECURE_CERT_PF_CUST_FLASH:
        part = esp_secure_cert_find_partition(ESP_SECURE_CERT_CUST_FLASH_PARTITION_TYPE, ESP_SECURE_CERT_PARTITION_NAME, ESP_SECURE_CERT_PF_CUST_FLASH);
        if (part != NULL) {
            ESP_LOGI(TAG, "Pre-provisioned partition information:");
            ESP_LOGI(TAG, "partition format: %s, partition name: %s", "CUST_FLASH", ESP_SECURE_CERT_PARTITION_NAME);
            return part;
        }

    // fall through
    case ESP_SECURE_CERT_PF_NVS:
        nvs_partition_name = ESP_SECURE_CERT_PARTITION_NAME;
        nvs_namespace_name = ESP_SECURE_CERT_PARTITION_NAME;
        part = esp_secure_cert_find_partition(ESP_SECURE_CERT_NVS_PARTITION_TYPE, nvs_partition_name, ESP_SECURE_CERT_PF_NVS);

        if (part != NULL) {
            if (nvs_flash_init_partition(nvs_partition_name) != ESP_OK) {
                ESP_LOGE(TAG, "NVS partition %s was found but inititlization failed", nvs_partition_name);
                return NULL;
            }
            ESP_LOGD(TAG, "Partition found, current format is NVS.");
            ESP_LOGD(TAG, "NVS partition %s is inititalized", nvs_partition_name);
            esp_err_t err;
            nvs_handle_t handle;

            err = nvs_open_from_partition(nvs_partition_name, nvs_namespace_name, NVS_READONLY, &handle);
            if (err == ESP_OK) {
                ESP_LOGI(TAG, "Pre-provisioned partition information:");
                ESP_LOGI(TAG, "partition format: %s, partition name: %s, partition namespace: %s", "NVS", nvs_partition_name, nvs_namespace_name);
                nvs_close(handle);
                return part;
            }

            nvs_namespace_name = ESP_SECURE_CERT_LEGACY_PARTITION_NAME;
            err = nvs_open_from_partition(nvs_partition_name, nvs_namespace_name, NVS_READONLY, &handle);
            nvs_close(handle);
            if (err == ESP_OK) {
                ESP_LOGI(TAG, "Pre-provisioned partition information:");
                ESP_LOGI(TAG, "partition format: %s, partition name: %s, partition namespace: %s", "NVS", nvs_partition_name, nvs_namespace_name);
                return part;
            } else {
                ESP_LOGE(TAG, "Failed to open nvs partition %s with namespace: %s", nvs_partition_name, nvs_namespace_name);
                return NULL;
            }
        }

        esp_err_t err;
        nvs_handle_t handle;
        nvs_partition_name = ESP_SECURE_CERT_LEGACY_PARTITION_NAME;
        nvs_namespace_name = ESP_SECURE_CERT_LEGACY_PARTITION_NAME;
        part = esp_secure_cert_find_partition(ESP_SECURE_CERT_NVS_PARTITION_TYPE, nvs_partition_name, ESP_SECURE_CERT_PF_NVS);
        if (part != NULL) {
            if (nvs_flash_init_partition(nvs_partition_name) != ESP_OK) {
                ESP_LOGE(TAG, "NVS partition %s was found but inititlization failed", nvs_partition_name);
                return NULL;
            }
            err = nvs_open_from_partition(nvs_partition_name, nvs_namespace_name, NVS_READONLY, &handle);
            nvs_close(handle);
            if (err == ESP_OK) {
                ESP_LOGI(TAG, "Pre-provisioned partition information:");
                ESP_LOGI(TAG, "partition format: %s, partition name: %s, partition namespace: %s", "NVS", nvs_partition_name, nvs_namespace_name);
                return part;
            } else {
                ESP_LOGE(TAG, "Failed to open nvs partition %s with namespace: %s", nvs_partition_name, nvs_namespace_name);
                return NULL;
            }
        }

    // fall through
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        part = esp_secure_cert_find_partition(ESP_SECURE_CERT_CUST_FLASH_PARTITION_TYPE, ESP_SECURE_CERT_LEGACY_PARTITION_NAME, ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY);
        if (part != NULL) {
            ESP_LOGI(TAG, "Partition found, current format is cust flash legacy.");
            ESP_LOGI(TAG, "Current partition format: %s, partition name: %s", "CUST_FLASH_LEGACY", ESP_SECURE_CERT_LEGACY_PARTITION_NAME);
            return part;
        }

    // fall through
    case ESP_SECURE_CERT_PF_INVALID:
    default:
        current_partition_format = ESP_SECURE_CERT_PF_INVALID;
        ESP_LOGE(TAG, "Failed to get esp_secure_cert partition");
        return NULL;
    }
    return NULL;
}

static void esp_secure_cert_get_partition_format(void)
{
    if (current_partition_format != ESP_SECURE_CERT_PF_INVALID) {
        return;
    }

    const esp_partition_t *part = esp_secure_cert_get_partition();
    if (part == NULL) {
        ESP_LOGE(TAG, "Failed to obtain the current partition and partition format");
        current_partition_format = ESP_SECURE_CERT_PF_INVALID;
    }
    return;
}

