rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_read.c
static int nvs_get(const char *name_space, const char *key, char *value, size_t *len, size_t type)
{
    esp_err_t err;
    nvs_handle_t handle;

    err = nvs_open_from_partition(nvs_partition_name, name_space, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not open NVS handle (0x%x)!", err);
        return err;
    }

    switch (type) {
    case NVS_STR:
        err = nvs_get_str(handle, key, value, len);
        break;
    case NVS_BLOB:
        err = nvs_get_blob(handle, key, value, len);
        break;
    case NVS_U8:
        err = nvs_get_u8(handle, key, (uint8_t *)value);
        break;
    case NVS_U16:
        err = nvs_get_u16(handle, key, (uint16_t *)value);
        break;
    default:
        ESP_LOGE(TAG, "Invalid type of NVS data provided");
        err = ESP_ERR_INVALID_ARG;
    }

    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error (0x%02X) reading NVS data!", err);
        return err;
    }

    nvs_close(handle);
    return err;
}

esp_err_t esp_secure_cert_init_nvs_partition(void)
{
    const esp_partition_t *part = esp_secure_cert_get_partition();
    if (part == NULL) {
        ESP_LOGE(TAG, "Could not get partition.");
        return ESP_FAIL;
    }

    if (nvs_flash_init_partition(ESP_SECURE_CERT_PARTITION_NAME) == ESP_OK) {
        return ESP_OK;
    } else {
        return nvs_flash_init_partition(ESP_SECURE_CERT_LEGACY_PARTITION_NAME);
    }
}

static esp_err_t esp_secure_cert_read_raw_flash(const esp_partition_t *partition, uint32_t src_offset, void *dst, uint32_t size)
{
    /* Encrypted partitions need to be read via a cache mapping */
    const void *buf;
    spi_flash_mmap_handle_t handle;
    esp_err_t err;

    err = esp_partition_mmap(partition, src_offset, size, SPI_FLASH_MMAP_DATA, &buf, &handle);
    if (err != ESP_OK) {
        return err;
    }
    memcpy(dst, buf, size);
    spi_flash_munmap(handle);
    return ESP_OK;
}

const void *esp_secure_cert_mmap(const esp_partition_t *partition, uint32_t src_offset, uint32_t size)
{
    /* Encrypted partitions need to be read via a cache mapping */
    const void *buf;
    spi_flash_mmap_handle_t handle;
    esp_err_t err;

    err = esp_partition_mmap(partition, src_offset, size, SPI_FLASH_MMAP_DATA, &buf, &handle);
    if (err != ESP_OK) {
        return NULL;
    }
    return buf;
}

static esp_err_t esp_secure_cert_read_metadata(esp_secure_cert_metadata *metadata, size_t offset, const esp_partition_t *part, uint32_t *data_len, uint32_t *data_crc)
{
    esp_err_t err;
    err = esp_secure_cert_read_raw_flash(part, ESP_SECURE_CERT_METADATA_OFFSET, metadata, sizeof(esp_secure_cert_metadata));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not read metadata.");
        return ESP_FAIL;
    }

    if (metadata->magic_word != ESP_SECURE_CERT_METADATA_MAGIC_WORD) {
        ESP_LOGE(TAG, "Metadata magic word does not match");
        return ESP_FAIL;
    }

    switch (offset) {
    case ESP_SECURE_CERT_METADATA_OFFSET:
        *data_len = sizeof(metadata);
        break;
    case ESP_SECURE_CERT_DEV_CERT_OFFSET:
        if (current_partition_format == ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY) {
            /* In the legacy format the order of dev_cert_len, dev_cert_crc have been interchanged with ca_cert_len and ca_cert_crc */
            /* Returning the appropriate values here */
            *data_len = metadata->ca_cert_len;
            *data_crc = metadata->ca_cert_crc;
        } else {
            *data_len = metadata->dev_cert_len;
            *data_crc = metadata->dev_cert_crc;
        }
        break;
    case ESP_SECURE_CERT_CA_CERT_OFFSET:
        if (current_partition_format == ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY) {
            /* In the legacy format the order of dev_cert_len, dev_cert_crc have been interchanged with ca_cert_len and ca_cert_crc */
            /* Returning the appropriate values here */
            *data_len = metadata->dev_cert_len;
            *data_crc = metadata->dev_cert_crc;
        } else {
            *data_len = metadata->ca_cert_len;
            *data_crc = metadata->ca_cert_crc;
        }
        break;
#ifndef CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL
    case ESP_SECURE_CERT_PRIV_KEY_OFFSET:
        *data_len = metadata->priv_key_len;
        *data_crc = metadata->priv_key_crc;
        break;
#else /* !CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL */
    case ESP_SECURE_CERT_CIPHERTEXT_OFFSET:
        *data_len = metadata->ciphertext_len;
        *data_crc = metadata->ciphertext_crc;
        break;
    case ESP_SECURE_CERT_IV_OFFSET:
        *data_len = metadata->iv_len;
        *data_crc = metadata->iv_crc;
        break;
#endif /* CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL */
    default:
        err = ESP_ERR_INVALID_ARG;
        ESP_LOGE(TAG, "Invalid offset value given");
    }

    return err;
}

static esp_err_t esp_secure_cert_get_addr(size_t offset, char **buffer, uint32_t *len)
{
    esp_err_t err;
    static esp_secure_cert_metadata metadata;
    uint32_t data_len = 0;
    uint32_t data_crc = 0;

    const esp_partition_t *part = esp_secure_cert_get_partition();
    if (part == NULL) {
        ESP_LOGE(TAG, "Could not get partition.");
        return ESP_FAIL;
    }

    err = esp_secure_cert_read_metadata(&metadata, offset, part, &data_len, &data_crc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error in reading the metadata");
        return err;
    }

    *len = data_len;
    *buffer = (char *)esp_secure_cert_mmap(part, offset, *len);
    if (buffer == NULL) {
        return ESP_FAIL;
    }

    uint32_t read_crc = esp_crc32_le(UINT32_MAX, (const uint8_t * )*buffer, data_len);
    if (read_crc != data_crc) {
        ESP_LOGE(TAG, "Data has been tampered");
        return ESP_FAIL;
    }
    return ESP_OK;
}

esp_err_t esp_secure_cert_get_device_cert(char **buffer, uint32_t *len)
{
    // This API sets the global variable current_partition_format
    esp_secure_cert_get_partition_format();
    esp_err_t ret;
    switch (current_partition_format) {
    case ESP_SECURE_CERT_PF_TLV:
        return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_DEV_CERT_TLV, ESP_SECURE_CERT_SUBTYPE_MAX, buffer, len);

    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return esp_secure_cert_get_addr(ESP_SECURE_CERT_DEV_CERT_OFFSET, buffer, len);;

    case ESP_SECURE_CERT_PF_NVS:
        ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_DEV_CERT, NULL, (size_t *)len, NVS_STR);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to get device cert length from nvs");
            return ret;
        }

