rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_read.c
        *buffer = (char *)calloc(1, *len + 1);
        if (*buffer == NULL) {
            ESP_LOGE(TAG, "Not enough memory for device cert buffer");
            return ESP_ERR_NO_MEM;
        }

        return nvs_get(nvs_namespace_name, ESP_SECURE_CERT_DEV_CERT, *buffer, (size_t *)len, NVS_STR);

    case ESP_SECURE_CERT_PF_INVALID:
    default:
        ESP_LOGE(TAG, "Invalid flash format");
        return ESP_FAIL;
    }

}

esp_err_t esp_secure_cert_free_device_cert(char *buffer)
{
    switch(current_partition_format) {
    // fall through
    case ESP_SECURE_CERT_PF_TLV:
    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return ESP_OK;
        break;

    case ESP_SECURE_CERT_PF_NVS:
        free(buffer);
        return ESP_OK;
        break;
    case ESP_SECURE_CERT_PF_INVALID:
    default:
        return ESP_FAIL;
    }
}

esp_err_t esp_secure_cert_get_ca_cert(char **buffer, uint32_t *len)
{
    // This API sets the global variable current_partition_format
    esp_secure_cert_get_partition_format();
    esp_err_t ret;

    switch (current_partition_format) {
    case ESP_SECURE_CERT_PF_TLV:
        return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_CA_CERT_TLV, ESP_SECURE_CERT_SUBTYPE_MAX, buffer, len);

    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return esp_secure_cert_get_addr(ESP_SECURE_CERT_CA_CERT_OFFSET, buffer, len);

    case ESP_SECURE_CERT_PF_NVS:
        ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_CA_CERT, NULL, (size_t *)len, NVS_STR);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to get ca cert length from nvs");
            return ret;
        }

        *buffer = (char *)calloc(1, *len + 1);
        if (*buffer == NULL) {
            ESP_LOGE(TAG, "Not enough memory for ca cert buffer");
            return ESP_ERR_NO_MEM;
        }
        return nvs_get(nvs_namespace_name, ESP_SECURE_CERT_CA_CERT, *buffer, (size_t *)len, NVS_STR);

    case ESP_SECURE_CERT_PF_INVALID:
    default:
        ESP_LOGE(TAG, "Invalid flash format");
        return ESP_FAIL;
    }

}

esp_err_t esp_secure_cert_free_ca_cert(char *buffer)
{
    switch(current_partition_format) {
    // fall through
    case ESP_SECURE_CERT_PF_TLV:
    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return ESP_OK;
        break;

    case ESP_SECURE_CERT_PF_NVS:
        free(buffer);
        return ESP_OK;
        break;
    case ESP_SECURE_CERT_PF_INVALID:
    default:
        return ESP_FAIL;
    }
}

#ifndef CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL
esp_err_t esp_secure_cert_get_priv_key(char **buffer, uint32_t *len)
{

    // This API sets the global variable current_partition_format
    esp_secure_cert_get_partition_format();
    esp_err_t ret;

    switch (current_partition_format) {
    case ESP_SECURE_CERT_PF_TLV:
        return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_PRIV_KEY_TLV, ESP_SECURE_CERT_SUBTYPE_MAX, buffer, len);
    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return esp_secure_cert_get_addr(ESP_SECURE_CERT_PRIV_KEY_OFFSET, buffer, len);;

    case ESP_SECURE_CERT_PF_NVS:
        ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_PRIV_KEY, NULL, (size_t *)len, NVS_STR);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to get priv key length from nvs");
            return ret;
        }

        *buffer = (char *)calloc(1, *len + 1);
        if (*buffer == NULL) {
            ESP_LOGE(TAG, "Not enough memory for priv key buffer");
            return ESP_ERR_NO_MEM;
        }

        return nvs_get(nvs_namespace_name, ESP_SECURE_CERT_PRIV_KEY, *buffer, (size_t *)len, NVS_STR);

    case ESP_SECURE_CERT_PF_INVALID:
    default:
        ESP_LOGE(TAG, "Invalid flash format");
        return ESP_FAIL;
    }

}

esp_err_t esp_secure_cert_free_priv_key(char *buffer)
{
    switch(current_partition_format) {
    // fall through
    case ESP_SECURE_CERT_PF_TLV:
    case ESP_SECURE_CERT_PF_CUST_FLASH:
    case ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY:
        return ESP_OK;
        break;

    case ESP_SECURE_CERT_PF_NVS:
        free(buffer);
        return ESP_OK;
        break;
    case ESP_SECURE_CERT_PF_INVALID:
    default:
        return ESP_FAIL;
    }
}
#endif

#ifdef CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL
static esp_err_t esp_secure_cert_read(size_t offset, unsigned char *buffer, uint32_t *len)
{
    esp_err_t err;
    static esp_secure_cert_metadata metadata;
    uint32_t data_len = 0;
    uint32_t data_crc = 0;

    const esp_partition_t *part = esp_secure_cert_get_partition();
    if (part == NULL) {
        ESP_LOGE(TAG, "Could not get partition.");
        return ESP_FAIL;
    }

    err = esp_secure_cert_read_metadata(&metadata, offset, part, &data_len, &data_crc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error in reading the metadata");
        return err;
    }

    if (buffer == NULL) {
        *len = data_len;
        return ESP_OK;
    }

    if (*len < data_len) {
        ESP_LOGE(TAG, "Insufficient length of buffer. buffer size: %"PRIu32", required: %"PRIu32"", *len, data_len);
        return ESP_FAIL;
    }

    /* If the requested offset belongs to the medatada, return the already read metadata */
    if (offset == ESP_SECURE_CERT_METADATA_OFFSET) {
        memcpy(buffer, &metadata, sizeof(metadata));
        return ESP_OK;
    }

    err = esp_secure_cert_read_raw_flash(part, offset, buffer, data_len);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not read data.");
        return ESP_FAIL;
    }

    uint32_t read_crc = esp_crc32_le(UINT32_MAX, (const uint8_t * )buffer, data_len);
    if (read_crc != data_crc) {
        ESP_LOGE(TAG, "Data has been tampered");
        return ESP_FAIL;
    }

    return ESP_OK;
}

esp_ds_data_ctx_t *esp_secure_cert_get_ds_ctx(void)
{
    esp_secure_cert_get_partition_format();
    if (current_partition_format == ESP_SECURE_CERT_PF_TLV) {
        return esp_secure_cert_tlv_get_ds_ctx();
    }
    esp_err_t esp_ret;
    esp_ds_data_ctx_t *ds_data_ctx;
    uint32_t len = 0;
    ds_data_ctx = (esp_ds_data_ctx_t *)heap_caps_malloc(sizeof(esp_ds_data_ctx_t), MALLOC_CAP_INTERNAL);
    if (ds_data_ctx == NULL) {
        ESP_LOGE(TAG, "Error in allocating memory for esp_ds_data_context");
        goto exit;
    }

    ds_data_ctx->esp_ds_data = (esp_ds_data_t *)heap_caps_calloc(1, sizeof(esp_ds_data_t), MALLOC_CAP_INTERNAL);
    if (ds_data_ctx->esp_ds_data == NULL) {
        ESP_LOGE(TAG, "Could not allocate memory for DS data handle ");
        goto exit;
    }

    // This API sets the global variable current_partition_format

    if (current_partition_format == ESP_SECURE_CERT_PF_CUST_FLASH || current_partition_format == ESP_SECURE_CERT_PF_CUST_FLASH_LEGACY) {
        char *buffer;
        len = 0;
        esp_ret = esp_secure_cert_get_addr(ESP_SECURE_CERT_CIPHERTEXT_OFFSET, &buffer, &len);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading ciphertext");
            goto exit;
        }

        memcpy((void *)ds_data_ctx->esp_ds_data->c, buffer, len);

        len = 0;
        esp_ret = esp_secure_cert_get_addr(ESP_SECURE_CERT_IV_OFFSET, &buffer, &len);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading initialization vector");
            goto exit;
        }

        memcpy((void *)ds_data_ctx->esp_ds_data->iv, buffer, len);
        unsigned char metadata[ESP_SECURE_CERT_METADATA_SIZE] = {};
        len = sizeof(metadata);
        esp_err_t err = esp_secure_cert_read(ESP_SECURE_CERT_METADATA_OFFSET, metadata, &len);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading metadata");
            goto exit;
        }
        ds_data_ctx->rsa_length_bits = ((esp_secure_cert_metadata *)metadata)->rsa_length;
        ds_data_ctx->efuse_key_id = ((esp_secure_cert_metadata *)metadata)->efuse_key_id;
        return ds_data_ctx;

    } else if (current_partition_format == ESP_SECURE_CERT_PF_NVS) {
        len = ESP_DS_C_LEN;
        esp_ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_CIPHERTEXT, (char *) ds_data_ctx->esp_ds_data->c, (size_t *) &len, NVS_BLOB);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading ciphertext");
            goto exit;
        }

        len = ESP_DS_IV_LEN;
        esp_ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_IV, (char *)ds_data_ctx->esp_ds_data->iv, (size_t *)&len, NVS_BLOB);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading initialization vector");
            goto exit;
        }

        esp_ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_EFUSE_KEY_ID, (void *)&ds_data_ctx->efuse_key_id, 0, NVS_U8);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading efuse key id");
            goto exit;
        }

        esp_ret = nvs_get(nvs_namespace_name, ESP_SECURE_CERT_RSA_LEN, (void *)&ds_data_ctx->rsa_length_bits, 0, NVS_U16);
        if (esp_ret != ESP_OK) {
            ESP_LOGE(TAG, "Error in reading rsa key length");
            goto exit;
        }
        return ds_data_ctx;
    }

exit:
    if (ds_data_ctx != NULL) {
        free(ds_data_ctx->esp_ds_data);
    }
    free(ds_data_ctx);
    return NULL;
}

void esp_secure_cert_free_ds_ctx(esp_ds_data_ctx_t *ds_ctx)
{
    esp_secure_cert_get_partition_format();
    if (current_partition_format == ESP_SECURE_CERT_PF_TLV) {
        esp_secure_cert_tlv_free_ds_ctx(ds_ctx);
    }

    if (ds_ctx != NULL) {
        free(ds_ctx->esp_ds_data);
    }
    free(ds_ctx);
}
#endif
